{
    "": 0,
    "明明就是像派大星吧": 0,
    "要200%的認真": 1,
    "老師很用心但是上課要很認真 !不會考試": 1,
    "請問這個老師的課怎麼樣呢？": 0,
    "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈": 0,
    "肌肉來著": 0,
    "很少點名": 1,
    "覺得考試有點難~~~~~~~~~之前我學習單明明寫對 然後他改錯了 我拿去跟他說 他居然還說我是剛剛竄改答案的!!!生氣TTTTTTT": 1,
    "不推==": 1,
    "點名點一三節，人太少時會點第二": 1,
    "第二節上課才點名": 1,
    "可以學到很多，不好好準備會很慘，這是必修啊": 1,
    "老師人不錯，就作業有點麻煩。": 1,
    "後面申論題選二寫吧": 0,
    "壓力大但學到很多+1": 1,
    "操作一款貴到嚇死人的excel": 0,
    "課滿好過的但是老師很雷，常常被氣到": 1,
    "期末考好難@@": 1,
    "無比難過，老師英文超級台，叫學生沒事不要找他，他覺得跟學生溝通很麻煩。": 1,
    "認真上可以學到很多東西，會讓你思考很多事情好過 推  可以補點名": 1,
    "很注重期末報告，期末報告除了老師評分外，還會同學間互評，老師聽到不爽或有覺得不滿意的地方，會不留情面直接批評，建議選擇早一點報告，因為後面的人通常都被罵得比較慘。": 1,
    "要做報告+讀書心得": 1,
    "平時上課有時候會有小作業讓小組討論這是平時成績": 1,
    "陳x川老師教的又少又沒內容": 1,
    "但有修過的人說不錯": 1,
    "老師人超好，也會讓大家有機會說話": 1,
    "老師上課很認真,學的到東西,期中期末都是報告": 1,
    "老師人不錯，但作業很重，每個禮拜都要交進度，而且很重視準時繳交。認真學可以學到很多東西，但是要有心理準備～": 1,
    "掰的有道理她也會給妳分": 1,
    "想多碰一些器材的人可以考慮，老師根據學生想學什麼就教什麼，上課很自由而且老師很熱心喜歡學生問問題！有不懂的老師會直接示範。": 1,
    "選就對了~": 1,
    "期中考試期末報告，都滿簡單的": 1,
    "爽過老師 不相信的快選": 1,
    "不推，雷課~期中寫滿滿的不及格......": 1,
    "老師說自己是Maya之神": 0,
    "上課都有把答案講出來": 1,
    "期中期末考 只要會英文翻譯就沒問題": 1,
    "買一堆書法用具就算了，上課還要聽老師說屁話，講他過去的豐功偉業，時不時被他酸一下。很看重出缺席，考試、作業也要照著他的字帖寫，就算你寫的再漂亮，沒照他字帖寫分數就不高": 1,
    "但是報告很多,期中期末考申論但是都會給題目": 1,
    "愛點名 兩節點兩次": 1,
    "利用同學幫自己公司作案子~哼": 0,
    "雖沒修過": 0,
    "老師上課非常地用心，只要學生有任何問題，他都會很樂意地幫忙解決，也很希望學生能夠多問一些問題，老師是一個非常認真又很有趣的人，也相當重視學生學習的態度，像是出缺席或是上課都不做作業，反而在做別的事情，他會非常地介意": 1,
    "不修對不起自己": 1,
    "低空飛過呵呵.......": 0,
    "堂堂~給帥哥老師上課不無聊，做產設蓋模有問題都可問老師人超好": 1,
    "下課前10分鐘點名": 0,
    "很愛學生": 1,
    "改的蠻嚴的": 1,
    "老師很認真在教，作業量也不多": 1,
    "這學期的上課方式是怎麼樣子? 有要抄筆記?": 0,
    "分數給不高": 1,
    "老師人超好 不過還是請大家不要欺負老師 作業要按時交 不要讓老師催": 1,
    "切記 !!!!!!!! 上課絕對不要聊天滑手機睡覺 !!!!!! 他會暴走 !!!! 直接在全班面前點你的名字。": 1,
    "那一定要創作舞蹈在同學面前跳舞嗎..不推，上課很像硬把內容擠出來的感覺，而且每次的觀點答案都是O跟X都可以根本沒有絕對的答案": 1,
    "104(二)的世界文明期中作業是交個人報告的作業， 老師會訂主題 ，可以word或PPT 或影片等形式交作業!": 1,
    "同上，一樣老師，大推": 1,
    "上課睡覺玩手機隨便你": 1,
    "老師人親切": 1,
    "而且必點名": 1,
    "老師私底下人很好，連軟體都會給你檔案，只是上課比較嚴肅，評作業比較不留情面。真心想學攝影相關知識的人，會學到很多東西，這不是純粹看照片的課謝謝。作業多，要看展覽，要寫心得，參加比賽，仿拍，還要做影片，所以不輕鬆。考試的部分，平常上課要做筆記，他不會把課堂簡報放moodle，然後會再另外給講義，都要背，都會考，而且考填充簡答。": 1,
    "老師人超～級～好～": 1,
    "好老師 輕鬆過的課 人不多(下雨或節慶)會點名 發言就能加分 期中交報告 期末申論 他會給題目": 1,
    "偶爾點人唸課文，考前勾題目，老師人滿好的": 1,
    "期中期末考他考得很活會結合歷史地理概念 難度不一定 我修的時候 他那次期中考考的超難 寫單字填空跟配合還有申論 期末很佛心的考選擇題": 1,
    "老師上課有很多規定、嚴格": 1,
    "（一）是教剪接音效的基本軟體使用方法和辨別音樂的節奏": 0,
    "推！上課壓力不大又能學到很多，翻譯技巧也能提升，上課老師都讓同學們練習，考試也不會太難，難的話老師會給最低分七十分，意思就是最低有七十不會低於七十": 1,
    "是新來的老師很年輕很帥氣很nice~!推推~~": 1,
    "修他其他的課 真的不知道他到底在幹嘛!!學不到什麼東西.....": 1,
    "想問一下這堂課的分組以及考試方法～": 0,
    "有團體報告嗎 一定要分組嗎": 0,
    "她上課很好玩 雖然一開始會覺得他好愛走下來問想躲 但後來就變成聊天了, 有回答有加分, MOODLE也是 我是修世界文明 其中寫報告 期末考試": 1,
    "期中期末都考試 會給答案 直接按老師給的答案作答就行 還要唱望春風": 1,
    "霞姐是好人！！！": 1,
    "就自大啊": 0,
    "老師教得很不錯!有學到東西!雖然是理論的東西,但老師教的很活,讓你很容易記住": 1,
    "上課看電影，期中交心得報告，期末坐公仔，覺得好過": 1,
    "老師非常nice": 1,
    "3.上課老師會一直講,我也很認真聽,我想試著從": 0,
    "2D霸主不解釋": 0,
    "很好混很好過，不過學東西的話見仁見智": 1,
    "每次都會點名": 1,
    "之前老師就配合服貿更改課程內容 立場中立客觀": 1,
    "有時候他很忙不一定本人上課": 0,
    "完全不知道要幹嘛": 1,
    "期中期末考選擇題都從小考裡面出": 1,
    "輝哥的課真的沒理由不選": 1,
    "慈敏媽媽都用作業殺人": 1,
    "推!!就算不點名也會想去的課 可以學到很多!!": 1,
    "傻眼傻翻天的無敵雷課，學伴制什麼的根本專門當人用，期中考一定要有學伴沒學伴不給考，還在期中考週後才考，大家都退選退光光了，學伴退選留下來的人只能吃癟，上課還會上到一半扯到別的事扯不回來就算了重點是進度來不及了啊！上課給你做奇怪的眼球心理測驗還會催眠你真的根本邪教= =還會一直炫耀自己心理師的學歷MG MG MG = =": 1,
    "....... 別吧": 1,
    "學到很多~  大推~!!!": 1,
    "想知道上課方式": 0,
    "上課要有很多自己的想法,作業跟報告都是,然後報告的資料一定要看書,直接蒐網路的會當場.....": 1,
    "老師上課方式：非常輕鬆(喜歡講家常事，媽媽經之類的)，會討論時事。": 1,
    "相信上他的課可以學到東西": 1,
    "期中考試要認真念、背 不然考試一定不會寫(除非你對日本很熟)、會有考古題": 1,
    "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈": 0,
    "上課很輕鬆、自由，老師人很好，也很希望學生發表自己的想法或是提問，甚至會有一張表統計發言跟回答問題的次數，當作平時成績的加分": 1,
    "教學方式適合外向一點的同學,如果有點內斂也沒關係 習慣就好": 1,
    "幾乎不點名": 1,
    "如何如何": 0,
    "祥得:這是五、六年前的事你們怎麼知道的": 0,
    "是個好老師～上他的課有很大的收穫，個人是偏向那種對事情的想法看法之類的有很大的改變！！ 喜歡他一直讓我們思考各種問題～": 1,
    "上課輕鬆，好過！！": 1,
    "一學期2~3次PPT報告(有點像文學評論 可是要有邏輯跟引證 ) 期中會考試(不過不重要XD ) 期末有10頁PAPER (但那是每周作業累積成的 真的超累 會想殺了他的那種)": 1,
    "超想白眼她": 0,
    "想知道！！！！！！": 0,
    "天使老師": 1,
    "上課很無聊 老師講話沒什麼重點 但是門好過的課": 1,
    "老師不錯可以順便考證照，但每週都要到不然跟不上。": 1,
    "老師很可愛": 1,
    "會音樂的學生是寶": 1,
    "很好過，分組報告一次，基本上報告完就沒事了，期中期末都考文學作品朗誦，逐字唸會講英文就可以了。": 1,
    "可以學很多,但是不是門輕鬆的課,願意努力學習者建議可以試試看,對你會有幫助": 1,
    "課堂上放大部分攝影作品都是裸體or與性器官有關......老師對功課要求很高，功課也很多。有期中考，要拼很多攝影家的英文名字......很後悔期中不退掉它orz": 1,
    "期中有個小考 基本上是考他上課的東西": 1,
    "終於有位願意教大家一起進步的老師來到銘傳了!": 1,
    "期中申論(會給題目,答案在ppt)期末分組報告": 1,
    "完全不推薦然後期中29果斷退選": 1,
    "無聊 期末寫申論 考題會給 但是考得東西課堂都沒上到 要自己找": 1,
    "很好過": 1,
    "期中考差還可以補考～～覺得不錯": 1,
    "上課不要吃東西、遲到，不想抄筆記野放張紙在桌上，否則會狂罵，罵得越來越兇了。": 1,
    "不定時點名": 1,
    "moodle心得很重要，期末報告要求很高，會當場質疑學生的報告內容，緊張氣氛（期末報告時）": 1,
    "想混的別來，給的功課比必修加起來還多": 1,
    "臉皮不夠厚的 不推薦  因為只要他一罵起來就超可怕 很想找洞鑽.但別惹到他還是很平安的": 1,
    "前半學期上攝影基礎理論有點無聊，後半學傳統攝影方式(底片)，還要沖洗底片": 1,
    "不通人情": 1,
    "常常會要同學上傳小心得到moodle，幾十字的小心得，不可輕忽，之前以為只是moodle交差，結果因為沒交這些小小心得被當掉了。(事後陳情有把成績救回來)": 1,
    "老師長得像盛竹如,人超好,上課會補充很多東西,可以學到很多!": 1,
    "此堂非常適合磨練自己": 1,
    "要交2800考證照你敢信?": 1,
    "這堂課如何??": 0,
    "這個蠻難der..很多要背。。。而且一直要回答問題（記分）才有平時成績": 1,
    "有學過鋼琴、小提琴、長笛等樂器的同學可以修，對你們來說很容易，就是上音樂史的五個時期和作品曲式 ，其他同學千萬不要修。": 1,
    "上課下課都能跟老師打成一片，課餘時間去辦公室找老師問問題老師都會教你": 1,
    "做報告 讀書心得(1200字)": 1,
    "上學期文學入門focus on folk tales 下學期文學作品選讀focus on advertisement": 0,
    "不知道哪裡有問題的老師 我們班的人一堆被當 而且缺席不到三次 一直放音樂 以為學生音樂班嗎 超級不推老師人很好 可認真學習也可混水摸魚": 1,
    "重點是把期末APP報告&實作弄出來": 1,
    "旺旺喜欢奇怪的設計。越奇怪越高分。有分组报告及组作业。蛮有趣的。": 1,
    "學到很多平常不會接觸的知識，老師講課是跳躍式的想到什麼就講什麼，期中考試不是死背類的，自己查資料寫": 1,
    "滑手機、遲到等都是他會碎念你的點~": 1,
    "是個政治色彩很嚴重的老師，藍色的，對於當時太陽花學運的學生很不尊重甚至做出批判": 1,
    "波音747，博士您好": 0,
    "沒有期中期末，要交心得報告，簽到，老師人美心美": 1,
    "期末考感覺不會看考卷內容，感覺給比莫分，隨便寫85分過": 1,
    "推推老師要認真上課才會過，老師上課會自嗨": 1,
    "出題機車但改分數是三輪車": 1,
    "基本的解說導覽認知認識，不會很難": 1,
    "同學~~你胡說!": 0,
    "林老師的課,不修嗎?電子系台柱!": 0,
    "第三堂課抽點，全班點名會先說，期中交個報告。": 1,
    "推助教人超好": 0,
    "負擔重，想修好的話還要實地考察，需要衡量其他科的負擔，來決定要不要修": 1,
    "第二節最後10芬點名": 0,
    "英文不好的人還是別來吧": 1,
    "爽課!!": 1,
    "而且下學期才修的他還會複習 不會有跟不上的困難": 1,
    "認真跟他學才學得到東西，不然會發現整個學期都浪費了": 1,
    "數煤神秘檔案,入學至今從沒見過帽子底下的百慕達三角洲~呵呵": 0,
    "老師人好  上課輕鬆  考試簡單  又學的到東西!": 1,
    "雖然他是好過的  但是  但是 他真的太兇啦 一直罵人 太可怕了 他讓我滾出去！！還讓我去賣馬鈴薯 操！ 可是老師很好笑 哈哈哈哈  但是他平均每節課都會讓一兩個人滾出教室  如果你玩手機 或者沒做筆記 或者吃東西被他發現  你就等死吧 他會罵的你沒臉做人啊  嗚嗚嗚": 1,
    "推薦給想學東西的學生，想混的千萬別選": 1,
    "上課會瘋狂點人問問題": 1,
    "總之不要選真的很雷。": 1,
    "課程內容悶悶的，基本上都是教成音、錄音＂設備＂居多": 1,
    "每堂必點，期中要看古典音樂會，期末筆試 ，老師人好。": 1,
    "超級推!!!!老師上課很認真，有在聽有筆記期中考(moodle考)沒問題，期末報告也會很順利，有在聽課一定85↑": 1,
    "老師人好  很親切  考試簡單  又學的到東西! 超喜歡他~~": 1,
    "非常詳細又實用": 1,
    "上課照著指示做": 1,
    "校外教學去吃的亞都真的還好……": 0,
    "像是期中前把老師的考卷算一遍就會過": 1,
    "Its a TRAP!!!!作業量太多，課堂無聊，期中後班上退了一半。": 1,
    "老師教課很仔細，對同學提出的疑問都耐心解決，真的覺得是很好很好的老師～": 1,
    "雖然我大概是很久以前修的": 0,
    "有去有繳期中期末都會過": 1,
    "前幾天我的業力引爆，好加在我有修老師的課。感恩老師，讚嘆老師": 0,
    "老師上課不管人，你一走之前還會要你簽一下點名單再走嘛XD": 1,
    "人格不推,自己學自己的就好,不要想著老師會替自己把屎把尿": 1,
    "而且超愛炫耀自己學歷經歷怎樣怎樣～但是課也上的不怎麼樣，叫你買課本卻很少用，搞什麼學伴制的 考試一定要兩個人到才算分 出席也是…反正就是超爛": 1,
    "不能聊天好過  但分數不會給很高": 1,
    "真的是神經病": 1,
    "遲交作業補交要理不理你": 1,
    "不推的雷老師。": 1,
    "是一位肌肉猛男老師": 0,
    "基本上是爽課，原本不太點名只注重作業，但是曾經有一對系對幾乎沒來，作業都從別人那要來或偷來導致老師反彈，所以現在變得比較常點名，作業都是上課完成的，如果有朋友沒來就是友誼大考驗，不是朋友的沒來就變成人性大考驗。": 1,
    "都會點名，只要考試只要有考就有基本分": 1,
    "請問報告是分組還是個人?": 0,
    "主要是認識攝影家和作品": 1,
    "上課可以不用認真，只要老師板書抄得很整齊，跟你說是考試題目的抄起來就對了。抄完四題，其他時間就隨你開心了！期中考前兩周會放電影，那節課可以不用去，不點名。期中期末的考試題目在FB銘傳社團裡面有考古題，是一模一樣的！期中期末考試保證是最早交卷的，寫20分鐘嫌太多！": 1,
    "加分不手軟": 1,
    "有報告嗎??": 0,
    "期中期末考不難，申論題可能三選二或二選一寫，老師上課會說明申論題的走向，基本上只要不偏離太多，還是會給分，期末報告不難，看影片有影片心得要記得上傳": 1,
    "期中期末考試 不洩題推": 1,
    "我絕對不要上洪淑秋。。。": 1,
    "想詢問有期中或是期末考嗎？是線上的還是梅花座？": 0,
    "這堂課沒有戶外教學喔~": 0,
    "ppt字大一點": 0,
    "不想做作業的別來": 1,
    "老師人好又美~": 1,
    "考同類型改數字而已": 1,
    "會刪好友，利用完裝不認識，人格不推": 1,
    "大推 有一點歷史概念就會過，最後十分鐘點名，一學期兩次準時到家分點名。": 1,
    "推推推": 1,
    "大推~": 1,
    "◆特色": 0,
    "請問上課在上什麼？": 0,
    "機車老師煩死!": 1,
    "如果只是單純要學分 時間多  我覺得可以.但如果是想學東西..奉勸還是去選別的課比較不浪費時間": 1,
    "我不是乖乖牌學生嗯嗯別擔心": 0,
    "幹你娘 這個老師很好的 好不好 自己翹課被當就怪老師 說老師騙錢 老師播放影片的時候 100%你都是在睡覺的 老師利用影片裡的東西教學 你根本就沒聽 污衊老師": 1,
    "三個報告(期中期末平時)都有交就會很高分": 1,
    "基本上，一學期有六個作業，有閱讀心得、展覽心得、影音製作、廣告心得、MTV心得、電影心得，期中考只要你有專心上課，你可以拿好分數，雖然功課多、必名，但只要你對攝影有興趣，老師會讓你獲益良多，個人認為他是好老師。": 1,
    "很可怕，麥克風很大聲，年紀與聲音不符合，加分很奇怪，加滿也不知道自己到底拿幾分，一直說會沒有全勤重點是平時加分加很滿還是叫你舉手，會教你心裡治療法==根本是邪教，種之選她的課的人祝好運": 1,
    "會考名詞解釋，考前的作業會有一些是考題，其他就要自己猜題了....": 1,
    "上課很無聊,期中期末考試難": 1,
    "民法課  要分組": 1,
    "?????????": 0,
    "這課很好過，但每次上課都會點名，老師有時反覆不定，所以要一直向她確認以免到時候吃大虧，分數都給的不錯（即使上課都在玩手機），期末會有口頭報告，資料一定要詳細人很好~我那時上的課沒有分組~然後有創意作業 形式不拘": 1,
    "老師太吹毛求疵": 1,
    "實作為主，對機器人有興趣可以去修，蠻有趣的，最近改為EV3主機，好用又好玩": 1,
    "考證照 期中前後各考一張 兩者擇一即可 考過分數給很高 如果期中前考過了 到期末可以不用來上課 證照題目蠻多的 有念就還好 沒有報告 純粹電腦操作 然後考證照": 1,
    "有校外，上課用手機會很痛苦，可以睡覺，考試會洩題，背就對了，還要拍影片做報告噢！": 1,
    "一組做一份報告，期中期末考題會有分組報告相關的問答，基本上考前去moddle下載文件看看就可以，": 1,
    "其中是非+申論": 1,
    "期中有考試，期末去做一個地方性的研究報告就ok了，都會點名喔，考試會洩題，也有ppt可以看可以背不用擔心不會過~~": 1,
    "報告稍微認真做 出席率別太離譜 簡單輕鬆好過": 1,
    "上課教超慢 一直切螢幕還一直問好了沒 都快煩死了 然後兩節課下來感覺沒教多少東西 進度有夠慢 不知道在幹嘛": 1,
    "克服硬體操作的話不難": 1,
    "若要選此課，請慎重考慮!!!": 1,
    "期中期末考試會洩題": 1,
    "有人可以分享評價嘛？": 0,
    "99.99%都要靠自己念": 0,
    "必選 看到老師精神都來了! 可以學到東西 很輕鬆也很充實": 1,
    "給分寬鬆": 1,
    "很有趣的老師,講話有獨特的腔調,很會看手相,如果想略知自己命盤一二可以給他看手相  大推!": 1,
    "受益匪淺。": 1,
    "營養學分": 1,
    "要著正式服裝 of course 全英文": 1,
    "上課分組討論": 1,
    "作業超多 寫到煩": 1,
    "只看到有人說不推 可是到底為何不推..?考試很難 還是態度很差?  求解  拜託~~~": 0,
    "純學分": 0,
    "老師人好 沒有期中 期末 但有小考 小考簡單且開書考!": 1,
    "點名的時候要注意聽 老師不開投影機點名 舉手喊又太不明顯老師沒看到會不讓你補點 還會嗆你說老師沒點到你代表你很好": 1,
    "龜毛": 0,
    "第一次試上充分感受到老師的敏感跟神經質欸!!!媽呀~我要去退選!!!真的不推....": 1,
    "打嗝王": 0,
    "看影片寫心得 期末交遺囑": 1,
    "非常同意... 很自我中心的老師": 1,
    "老師說話很小聲很輕柔，可能是帶團體習慣的緣故。這堂課會先在一開始的幾週上簡單的團體歷程與需要注意的事項，接著需要設計一個團體(六次)，在期中之後需要實作。如果你對每個人彼此互相影響的力量感到好奇的話，這堂課會對你自己和別人很有幫助。可以訓練自己去統合大家的想法，還有促近彼此的接納與連結，若是有練習到當帶團體的領導，收穫匪淺。算是很棒的課，需要投注心力去參與": 1,
    "內容會選不少時事的文章(一定要專心抄筆記 還有他補充的單字) 上課前還會看BBC網站練聽力 可以學到不少東西": 1,
    "大推 很幽默的一個老師 爽過": 1,
    "每堂課都有去平時就會滿分了，期中期末也都很簡單~老師會洩題，考的是選擇跟問答": 1,
    "但如果你只是在一個組裡等著別人cover沒有想學習的心你就別選": 0,
    "看到老師彷彿看到萬丈光芒 老師你的翅膀勒": 1,
    "平時給100好課不選嗎": 1,
    "但是如果只有去第二節他會兩節都跟你點缺席(看心情)": 1,
    "期中個人作業期末申論，都非常死，不符格式作業重做，不符老師想法給低分：申論不合社課內容不給分，所以一定要筆記": 1,
    "？": 0,
    "想知道!!!!": 0,
    "能學到東西，作業一定要交，不能缺席太多次。": 1,
    "老師神好人!!只去過3次,有交足功課就好": 1,
    "期中期末皆有考試": 0,
    "= =": 0,
    "小名：賤嘴鄧": 0,
    "想知道老師上課方式": 0,
    "期中把音檔都聽過一遍就有100了": 1,
    "期中考５６ = =": 0,
    "Supervised learning、Unsupervised learning、Neural Networks、Fuzzy clustering analysis、 Neuro- Fuzzy System、Algorithms-Genetic Algorithms、Ant colony algorithm": 0,
    "這是網修吧？一定有很多人不知道網修是什麼，反正告訴你們就是上 moodle上課，而且不一定要再那個時間點上moodle，只是要交一份圖文並茂的古蹟旅遊心得報告，然後期中期末考試也別讀得太認真，我就是傻傻超認真讀的那位，後來發現他直接拿moodle上出的題目出題，完全一模一樣期中期末都沒變過....": 1,
    "上課別人報告的內容要聽": 1,
    "考試輕鬆寫，資料簡單看": 1,
    "老師人很好 每節會點名 每節會有講義 期中基本考講義 有點難度 認真看了..... 沒過": 1,
    "在一些小細節上很吹毛求疵": 1,
    "◆出缺席:": 0,
    "普通，只是老師要求多。": 1,
    "好過 推": 1,
    "考題都是後面習題 一模一樣 沒陷阱 推!!": 1,
    "推推長髮a永青": 0,
    "上課音量不要超過她就好   每次都會簽到": 1,
    "求解，這堂課如何！please": 0,
    "大推這個通識 看影片 沒考試 期中心得 期末心得or公仔": 1,
    "從來不休息不下課。每個人都要回答問題。點名點兩次。": 1,
    "用ppt上課重點都在裡面，會練習公文會打分數，期中前練習函；期末前練習寫信，考前會考小考，以上都是考試會出的內容，老師人不錯最後還請我們吃軟糖，讚~": 1,
    "老師超爛,上課只會教你玩手指": 0,
    "日本文化，期中考都是老師給的講義裡的，有紙本報告，基本上很好過": 1,
    "想爽過嗎 大推": 1,
    "要分組報告。": 0,
    "每堂課都會唸英文句子自己寫下來沒有解答，是期中期末的題目": 1,
    "上課去睡覺即可，但睡太多的話要注意期中考可能不會寫": 1,
    "講義會有日文，老師會講他的意思要記一下，曾經考出來過": 1,
    "聽說是一位長的像辛普森的老師 有報告要做": 1,
    "大推，很營養，上課睡覺、用手機老師基本都不太管。": 1,
    "我覺得很不推": 1,
    "上課很有趣，很有內容，期中期末申論題，記得念書。": 1,
    "除非你喜歡手相": 1,
    "個人報告 還是 小組": 0,
    "每週都有作業，負擔算有點重，但是照著他的課程走，就能變成PS高手": 1,
    "長相佼好的女同學要注意老師喜歡找你抬槓，一開始會覺得很煩，不過他其實沒惡意": 0,
    "翹到滿堂還是過": 1,
    "期末要做一份企業參訪的報告(要分組 分數佔蠻重的)": 1,
    "教的很好": 1,
    "他的上課方式???": 0,
    "要做報告": 1,
    "上課很愛跟女生哈啦543": 0,
    "老師很專業，上課很生動，隨然考試偏難，但是只要認真準備就可以過的": 1,
    "想請問這位老師的暑修~": 0,
    "沒有期中期末考，上課實作packet tracer要跟著做，期末有口試。": 1,
    "不能吃早餐": 0,
    "製作玻璃馬賽克時鐘跟燈飾": 1,
    "很好玩，但是有點燒錢，而且沖底片滿花時間，還會失敗。": 1,
    "老師講話很年輕哈哈": 1,
    "是說他會分組報告 之前其他的課報告 就一次大報告~": 1,
    "點名都不會上傳嗎！大推": 1,
    "不推 考試不易準備 期中給考古題根本看不完 還甚麼看印象給平時分數": 1,
    "但一定要有很carry的組員 因為每次報告都是一組一起報告 每個禮拜會有作業但不多 只要有寫就好 期中期末就是作業中的幾題 很好過": 1,
    "點名採簽名制，盡量不要幫忙簽，他會知道....": 1,
    "作業內容有一點重，課程內容紮實": 1,
    "老師人很好 建議想學東西再修 不適合混學分用": 1,
    "報告多,但沒啥壓力,上課滑手機不要太誇張一切都OK,推推推~~": 1,
    "期中考試20%期末辯論80%認真辯論做ppt上課多舉手就會過，期中只考20以為完蛋了，但是高分過": 1,
    "老師很喜歡罵髒話，雖說下課前10分鐘才點名，但不太要白目因為它有時候發現會罵人，然後題目上奇摩知識加找的到": 1,
    "期中考交報告，期末考影片內容上的申論題，每個禮拜只期待這門課。老師好人，大推！": 1,
    "大推，各種畫各種練習手繪": 1,
    "鬧事的老師，爛，拒絕去上課！": 1,
    "一開始上課會推你買很多書法用具,可以不買,但不買一些東西上課會唸一些有的沒的": 1,
    "簽到制，老師人很好不過上課真的稱不上有趣，有點難理解他在說甚麼": 1,
    "好過，只要有出席報告做好達到老師的要求，高分過關不是問題": 1,
    "很理論，這老師不認真上是不會過的，不過有在聽課不曠課基本上不會給太低": 1,
    "推，期中考題很簡單主要考古，期末報告不複雜，可缺席五週": 1,
    "如果是早八的話，八點會先點一個加分的名，九點才會點缺席。": 1,
    "無聊的課": 0,
    "寫小說 做記者": 1,
    "每次上課都有學到東西": 1,
    "看影片要寫心得，期末報告不難，但要先跟老師討論，基本上不難過，只是會常常聽到她在法國是LV的VIP言論與魚子醬～": 1,
    "老師獨攬權力，學生無法發揮長處，會問意見，但如果他不喜歡，白提": 1,
    "真的都是看YouTube影片，上課也不評圖，不知道到底去幹嘛的。": 1,
    "期中期末 背詩 8~10首 有背有分": 1,
    "期末考會給題目雖是手寫但滿分超過100": 1,
    "上課很輕鬆": 1,
    "上課會有小考 但是那些單字有認真抄筆記有背就OK": 1,
    "小考就是考他上課講的單字(有背有抄就有分)": 1,
    "真的可以學到很多專業名詞還有很多行銷的知識，是平常很少會接觸到的知識，很推薦認真的學生可以去修。": 1,
    "然後會自己弄像是大考的考卷 期中期末都有 會檢查抄的筆記 板書的字很漂亮~~": 1,
    "好過嗎?": 0,
    "老師人很好！上課是放PPT，期中期末都有作業，但很好過。": 1,
    "上課很輕鬆 認真聽也是可以學到東西(但真的很催眠..) 期中期末要交報告 不難 考試也會給題目 考前有看不至於考太低": 1,
    "三上選這門課算不錯的": 1,
    "期中考讀他給的檔案，期末分組上台報告": 1,
    "老師啪拉啪拉不間斷": 1,
    "要交讀書心得比較麻煩": 0,
    "性別歧視哭哭": 1,
    "這是我大學以來最像大學生要上的課(已經大四老生表示)": 1,
    "就不太會被當了": 1,
    "出席分非常重": 1,
    "ㄧ定要認真上課 稍微沒注意聽到她剛剛問的問題 老師點到你 答不出來就gg了...而且也不能請她再說ㄧ次問題QQ 然後最後ㄧ排坐遲到的同學 老師要問問題 會優先問最後一排的 建議要修這門課的人要是認真的同學啊～": 1,
    "平時突如其來的小作業要很謹慎，老師不會說截止期限，自己要注意": 1,
    "單純賺學分可以選": 1,
    "但都不難": 1,
    "笑裡藏刀": 1,
    "老師規則機車，人也機車，但是應該蠻好過的，聽她講故事-++-還不錯但老師隱隱約約給人一種很自大的感覺...": 1,
    "一有報告一直翹就對了推薦!!!老師很用心 學到很多": 1,
    "校外教學，去吃米其林棒棒噠，老師人很好，大推。報告是書面還是口頭???": 1,
    "老師上課認真，可以學到東西，考試一定要看老師的講義一定要看一定要看一定要看很重要!!其中期末都有考試，有團體報告*1，考試多手寫題，上課老師會講考試範圍，總之要學東西的大推!!!": 1,
    "但改的滿鬆的 只要你有認真背": 1,
    "這課好上嗎": 0,
    "有人知道這課是在幹嘛的嗎？": 0,
    "1.講義要自己印(不過都是短篇文章 OK的)": 1,
    "這堂課在做的是桃園龜山鄉的文化專題…沒興趣會覺得很無聊想知道!!!!!!!": 1,
    "考前勾題背答案，滿好過的。": 1,
    "期中期末都是交報告沒有考試": 1,
    "老師只會用網站上的影片教學，建議不要選，會累死自己！": 1,
    "必推鄭爸": 1,
    "我讀了大概一半,期中3X (我想說自己掰一點大概也有分數,沒想到他都沒給分)": 1,
    "看他上課=看戲": 1,
    "我會想直接跳過": 1,
    "Rhino專業講師，上課很詳細，大推": 1,
    "總有一堆情緒和表情": 1,
    "人很好": 1,
    "站著呢?": 0,
    "雷到爆!!!非常不推": 1,
    "老師在乎出席率，點名時間不定，但可以補點。老師給的講義很可愛都是圖片，期中期末考試選擇題加手寫，但很簡單。": 1,
    "上課絕對不可以吃東西，不然會被嗆爆，現在不一定是第二節點，有時是第一節，看他心情": 1,
    "我覺得修蔡仁傑的課最好一群人修 找組員眼睛要亮一點不要遇到地雷組員": 1,
    "選到會後悔": 1,
    "我也想知道TTTT本來不是這個老師啊啊啊...": 0,
    "老師很好笑": 0,
    "請問這個老師的排球課會很要求嘛？": 0,
    "會花蠻多時間跟你解釋選擇權": 1,
    "每個禮拜都有作業": 1,
    "上課方式就像評論兒童文學那門的大大講的一樣 我在此做個補充:": 0,
    "幾乎每個禮拜簽名點名": 1,
    "這學期他上課有時候會問問題，但答不出來也沒什麼影響啦。他還有考一次小考說可以加分，題型跟期中考的一樣喔～": 1,
    "人很好 課輕鬆 但真的....學完就忘": 1,
    "老師上的很認真": 1,
    "老師的課很好過  只要認真做好基本": 1,
    "但是你第二節才到他都會知道 還會在點名時碎念你": 0,
    "手機說不能滑 但其實大家也還是都在滑": 1,
    "超棒的老師，上課氣氛很融洽，也不會有太大壓力，上課聽聽故事，大推。": 1,
    "我是覺得可以訓練邏輯思考能力啦!!!": 1,
    "請問報告是分組還是個人呢?": 0,
    "西概的內容就是上那些上古到中古時期的經典文學 然後上課是分組報告 老師會邊評論邊上課": 1,
    "老師人超好, 即使你(西班牙語上)沒修,直接修下學期的也不會跟不上": 1,
    "上課吃飯睡覺打手機一律OK 不過一上課就點名 表示輕鬆無壓力": 1,
    "會去淨山，或是騎單車順便去做愛心活動（今年騎去雲林的育幼院）。上課部分會分組報告：有影片心得分享以及讀書分享。": 1,
    "老師很認真": 1,
    "老師人不錯 私底下問問題會很認真 認真學是能學到東西": 1,
    "很難過，不要想不開真的總經要天分沒天份就不要碰會拉低成績而且是拉很低很低": 1,
    "沒有期中考，但期中報告別忘了": 1,
    "老師上課雖然輕鬆有趣但是功課一定要記得繳": 1,
    "很妙的老師 適合認真的學生 可以學很多東西": 1,
    "老師講的話很少...": 0,
    "請問有分組報告嗎": 0,
    "考試找講義": 1,
    "期中期末考有考古題可參考，不缺席的話平時成績蠻高的": 1,
    "怎麼說呢...  高分是高分，但是喜歡點人起來問問題，又罵人罵得很難聽": 1,
    "必搶!考試就考平常練習的東西": 1,
    "老師很有趣，隔週點名，有時候點名加分，上課很好玩，考試會洩題。": 1,
    "期中期末考申論": 1,
    "有上過TCP/IP在選比較好，否則會很多聽不懂，可以學很多東西。": 1,
    "千萬不要質疑你的Maya之神": 0,
    "考前會有重點放在moodle": 1,
    "考古題可以去銘傳的FB社團找，都一模一樣，字寫好看點，90以上沒問題。": 1,
    "傻眼到爆": 1,
    "想休爽課者勿試！": 1,
    "會學到很多東西，但是功課非常多，有交功課基本上都會過。期中考試100題(......)，及格人數個位數，期末報告，也就是全部的功課": 1,
    "考試簡單 ，大家都80起跳，還蠻多人100。": 1,
    "超好過der": 1,
    "必過且高分": 1,
    "期中近代華人傳記1000字報告  期末考申論": 1,
    "老師上課都在說廢話": 1,
    "分組大概要幾個人啊??": 0,
    "作業有夠多 每個禮拜都有": 1,
    "邊玩邊學 好過": 1,
    "要求多 很囉嗦但會給你很高分的大叔~": 1,
    "期中考考申論，期末沒有考試，要做一本童書。": 1,
    "好玩又好過": 1,
    "看到秋光必選": 1,
    "二次平時考(簡答)、二次報告(老師會發案例 做分析)、期中期末從平時考的題目+案例出題": 1,
    "老師真的很用心 而且這門課可以學到很多東西 超級大推": 1,
    "第二堂給學生報告": 0,
    "好過ㄛ，老師上課基本上大家都在做自己的事哈哈，可以不用買課本，有考古或看ppt就可以了～": 1,
    "認真推 超好過 老師人很好 上課方式很輕鬆 就像聊天一樣 考試也不會太難": 1,
    "不過仁傑給分蠻高的 每次報告作業好好做 有交的話 10頁就做得出來 期末老師會跟小組Meeting 你回答得出來就好了": 1,
    "沒有回家作業": 1,
    "他都講一些冷笑話自己笑得很開心": 0,
    "我的更雷": 0,
    "上課不能吃東西": 0,
    "大推!!!!   老師人很好 很可愛的老爺爺  上課又可以學 打拳 防身術": 1,
    "有人可以分享嗎？": 0,
    "不是容易的爽課，但是上課很爽。": 1,
    "期中期末考試會實際模擬諮商過程，考過會發現很有趣，平時會需要與同組模擬諮商過程，錄下來寫成報告，需要寫逐字稿，這是花最多時間的報告，整體下來對於知識的實際運用很有幫助。": 1,
    "超級猛  而且他會從最基礎觀念開始教 教得真的超好": 1,
    "很好的老師": 1,
    "其實認真聽他上課會覺得還不錯有收穫!!": 1,
    "千萬要錯過": 1,
    "很努力的聽還是聽不懂他在教什麼，很好過，課本題目背一背": 1,
    "這門怎麼樣": 0,
    "上課不要講話": 0,
    "期中期末上台報告，分數給很高，老師人超好！大推！": 1,
    "然後講垃圾話": 0,
    "老師人很好，期中要看古典音樂會，期末筆試，大推": 1,
    "推推": 1,
    "請問要分組嗎": 0,
    "喜歡老師": 0,
    "考試是兩個人一組考,滿好過的！": 1,
    "覺得老師很好": 1,
    "爛": 1,
    "作業很廢時間": 1,
    "老師人超好~~~淚推淚推": 1,
    "我覺得蠻好玩的，老師反應也很可愛。哈哈哈。。。考卷真的很難。。。我不認真所以沒看懂題目再講啥": 1,
    "期中期末報告有交都不會太低分": 1,
    "點名分加分和扣分，隨機點，上課經常跑題，但是跑的題也很有意思，而且會請吃零食。期中考題目都會給，名詞解釋答案必須要提到他上課講過的內容，如果只是上網照抄分數不高，第二部分就是要敘述期末報告的動機和部分內容，如果都有準備很容易拿高分": 1,
    "覺得作業麻煩，不過老師還算好研究型的教授, 人很好, 不定期點名, 如果歷史好的話就超級輕鬆, 就算不是特別好只要不要太離譜也很容易過, 上課不管": 1,
    "有三堂": 0,
    "不推~~": 0,
    "迪士尼背景的老師,上課的方式可能會覺得無聊,但是老師教的內容是真正對自己有幫助的,建議把老師上課的ppt帶回家好好看,然後再上網找資料,隔周碰到老師在針對自己的問題跟老師說,老師會很開心滴": 1,
    "老師通常都是看心情點名的(尤其是班上人特別少的時候)": 1,
    "個人覺得滿好過的": 1,
    "其實是好過的課，上課可以學到非常多的東西，這堂課我不會想滑手機更不會想睡覺，老師很用心教學，每週三節上了一學期會吸收非常多與你生活中有關的知識，都是能夠幫助你未來在企業裡用得到的觀念和做事的想法，大推! 但是無心於學習的，真的是不要選這堂課，睡覺或玩手機，老師會給你難看，一種互相尊重的態度，你認真就是獲益良多，你混就是欠老師瞧": 1,
    "但唯一缺點是上課速度很快和超展開的補充~一定要專心抄筆記 還有他補充的單字 有問題一定要問他": 1,
    "不去都會過": 1,
    "上課氣氛太好了，會不知不覺睡著，容易睡著的同學別選。": 1,
    "平常上課準備要問問題的時候就認真聽一下 幾乎都是之後期中考題": 1,
    "老師人很好，講話有趣又豐富，超推": 1,
    "分數不知道要怎麼拿，舉手加分根本騙人的": 1,
    "推推推好老師好過都簽名點名": 1,
    "美感not good~~~還教什麼使用介面": 1,
    "要認真上課，要交一次2000字心得還是做報告，需要問別組問題，如果想輕鬆過不推，但可以學到不少東西!": 1,
    "超煩的~講話很難聽!!極不推": 1,
    "推!!!爽過又能學到東西~但之前聽老師說這門課今年開始已經不開囉": 1,
    "非常好的老師": 1,
    "第二節下課前才點名，老師人很好，期末報告主題自選，可以出去玩。考試內容都在PPT裡。": 1,
    "老師是上古典西方音樂~每節課都點名,期中期末考因為是聽音檔考試所以會提前一周考,根據我寫期中考的答案感覺會很低分 可是居然有8X...他上課不定時有加分題": 1,
    "期貨選擇權在三下": 0,
    "老師人很好 上課要分組 偶爾會有分組討論 期中期末考試要熟讀上課PPT的題目 有作業的話考試題目有些會從裡面出 期末報告很要求 一定要準時交 上台報告的時間要準時到 不然會扣分 每次點名 約上課10分鐘後": 1,
    "不要被文概課嚇到  其實很不錯": 1,
    "新老師，人超好": 1,
    "我的組員又很雷": 0,
    "大推": 1,
    "超誇張的老師，不會打說你小兒麻痺，都不教人，就叫你考試，考試考正手上炫、正手下炫、正手側炫、反手側炫，你是要培養國家隊喔，教人沒耐心回答問題講話超級衝，受傷了不能打，說干我什麼是你自己看著辦啊，硬是要人打了兩個小時，受傷部位都腫起來了，不打請假，他的課超重缺席，如果不幸選到他的課的朋友，建議你一堂都不能翹，這樣你們就可以不鳥他，如果是例假病假都不管你喔!照樣扣，套他的話就是:啊你整學期請病假就好了啊幹嗎來上課，喔我也很不想來啊傻眼，總之，選到的加油喔啾咪!": 1,
    "不太愛點名": 1,
    "分數：正常準備，成績80左右。": 1,
    "沒做會過嗎?上課幾乎會點名，除非老師忘記。期中期末考試都是moodle講義和上課影片內容。其實不會很難過，只是有點麻煩。每次第ㄧ堂都會播放影片，當週報告同學在影片撥完後要馬上用電腦打報告上台報告，其餘的組別則是依據影片給予評論。一組大概10個人。然後大概期末有些小小討論區與自己組別報告的評論。老師其實人滿好的，但會走下臺問同學問題。": 1,
    "上課基本上就是評圖，很少教什麼技巧，但練習他給的作業就是最好的教學": 1,
    "正課有分座位": 0,
    "爆了": 0,
    "好玩的課": 1,
    "推馬德睿~很可愛的老師 好過又可以學到東西 而且也很幽默 他中文講超好的": 1,
    "會需要做簡單作品，考期中考(ppt內容會說要考甚麼) 期中個人創意心得作業，期末心得回饋單，點名不固定非常討人厭的老師 我期中85缺席過兩次但每次作業都有做 期末很難 然後考完老師死不公布成績到最後一刻我才知道被當了乾": 1,
    "老師人好 考前一周會重點整理 段考題來自於國考題 好過": 1,
    "一學期有一次團體的英文報告,老師很注重報告的部分,期中期末皆有考試": 1,
    "點名是靠小組成員告知小老師誰沒來": 1,
    "還": 0,
    "個人報告？": 0,
    "然後分數他最低分會給70(研究所的最低分)~~好好上課 不用擔心不會過": 1,
    "有校外教學的活動": 1,
    "雅芳的課如果你是第一次修，可以學到很多很實用。": 1,
    "教學隨便 不負責任": 1,
    "偉華大大人超好~~~每次moodle作業準時交 準時考試  老師都不會刁難你~ 上台練習會加分 然後聽他改我們千奇百怪寫的錯誤XD 可以學不少東西啦": 1,
    "老是掛在黑板上，學生掛在考卷上": 1,
    "老師很正!❤": 1,
    "請問這個老師的上課方式怎麼樣呢？": 0,
    "雖然要交作業和上台報告，但基本上老師不會太為難~總之就是要去上課!!每堂都會點名": 1,
    "慈祥爺爺": 1,
    "期中看音樂會，分數給超低，然後告訴你怕你期末亂考，什麼鬼理由都有。": 1,
    "翹到滿堂會是過": 1,
    "啊就很難搶啊": 0,
    "肌肉老師": 0,
    "老師人好又美!": 1,
    "上課平淡,報告要求很多需要照著格式寫,組員每個禮拜都要上傳討論進度,閱讀心得兩千字 不推!": 1,
    "好像過了幾分鐘後就算你這節曠課，分數扣很重。": 0,
    "老師超級無敵率上課感覺很舒服": 1,
    "老師人很好很幽默，期中考試考題範圍好好的查資料寫出來就會很高分。期末報告主題自選(就算是介紹動漫也可以)，不要求分組": 1,
    "駱老師教得很好，尤其在橘色輔助設計這一塊": 1,
    "垃圾課": 1,
    "推助教人很好": 0,
    "加一": 0,
    "杜偉嘉是大地雷…  千千萬萬不要修到他的課……   很多硬性要求，難以溝通，很自我中心…  請慎選": 1,
    "必搶，上課超free，期中不考，期末開書考": 1,
    "簽王!": 1,
    "看老師名字大概就知道都在做報告": 0,
    "想學東西 來找祖鳳就對了": 1,
    "我上學期修的 上課不小心會睡著(這當然不要學啦哈哈) 期中看一下PPT然後掰考試80幾 期末沒考試 但有一個專書報告 有點麻煩 1000還2000字以上有點忘了... 還有一個團體報告自訂主題 老師人好 很像社會學者": 1,
    "期末報告很難": 1,
    "請問一下這堂課好過嗎?": 0,
    "他會配合學生的步調也會跟同學互動~有問題盡量問他就對了": 1,
    "好老師 可以認識很多東西又很好過 其中會給題目分數好拿": 1,
    "對攝影有興趣的上起課才不會覺得無聊麻煩，可以學到很多東西，功課多，老師人不錯，講話直接，好就好，不好就不好": 1,
    "超好過！！！！": 1,
    "一個用心的好老師，當他的學生需要都多多主動自發": 1,
    "老師上課東拉西扯，講話用有口音的英文上，上課學不到東西，很好混，不會管你在幹嘛，必點名，10分鐘報告，期中期末考課本，要背": 1,
    "很可愛": 1,
    "美女老師，天使老師 大推": 1,
    "上課準時拿愛心，其中會有一個相關報告，上課蠻活潑的，也可學到東西。": 1,
    "我沒修過": 0,
    "很親中的教授，對於引導學生設計發想這一塊蠻無感的": 1,
    "期末考試並不難，只要好好記熟老師期末複習的內容就可以拿到不錯的分數": 1,
    "期中會偷偷給提示": 1,
    "幾乎不點名 沒考試 可以學到很多東西 注重期末報告": 1,
    "超雷 老師很主觀 很愛批判以前學過的東西 個人覺得或許學識淵博 可是態度太自以為 同班有快20個修 過的不到10": 1,
    "千萬不要選": 1,
    "看他點不點名 一般簽到 被他點不到扣10分 平時給76 班代平時給99只是要常到不然他會不爽 期中報告400字而已 上課輕鬆 回答問題錯也可加分 自己畫加分 一題加平時兩分 有期末考(會發講義 講重{ㄏㄨㄟˋ}點{ㄎㄠˇ}部分)": 1,
    "如果已經修了三堂以上就別了吧，大同小異哦連期中報告期末教學演示(或短片)都一樣~": 1,
    "有人上過他的課嗎": 0,
    "不佳": 1,
    "求！": 0,
    "上課會學到很多專業知識，只是不會太深入，期中末考給的題目，要自己找答案，有看有分，每節點名。": 1,
    "這位老師的課會很難嗎?有要分組報告之類的嗎?": 0,
    "口頭禪很煩": 0,
    "考試都是考之前練過的東西": 1,
    "但人不壞、挺可愛的爺爺一個": 1,
    "但是一上課立馬點名 期中期末考題不難": 1,
    "上課會一直一直一直打嗝還用麥克風收音": 0,
    "極推!": 1,
    "給分如何啊？": 0,
    "筆者在校就讀時": 0,
    "老師有趣但分數給不高，掰文能力不好的話不算好過老師很親切,上課播放跟文明有關的影片或電影,之後會走下台問你問題或看法,都不會太難,也沒有標準答案,有回答者加分,點名如果第一節沒點到可以最後去補點,期中考老師出的主題,期末考有看影片都不會難": 1,
    "老師很棒！是個工商領域經驗豐富又和藹的人。他的課不太考試的，他認為我們在課堂上學到的就是最重要的，並不會要我們死背書。課堂進行方式是每周會有2~3組同學報告，接著我們記下重點，不懂的可以在課堂上詢問老師，老師都會很詳盡的回答。每次上課的最後一節，如果有時間老師就會讓我們做實務上的練習，所以你可以活生生的接觸到真實的演練，而非只有課本上冷冰冰的理論。老師很注重學生自己的應用，他說組織變革的各種理論，也可以套用在自己身上。": 1,
    "是簽到嗎還是親自點？": 0,
    "作業很簡單": 1,
    "上課不是從課本苦讀知識": 1,
    "浪費生命的課 不推": 1,
    "如果不喜歡帶團體或不喜歡接觸人群的 ，不適合這門課，人際壓力超大。\u000b老師說話有點小聲，可能有時候會聽不清楚": 1,
    "人很好，有念基本跟做ｍｏｏｄｌｅ題目基本上就過的了": 1,
    "報告ppt 有時會突然點名考試考故事內容 只要有大概寫也是過 有報告 但是其實網路上翻譯找找就可以了 在目豆有很多加分的可以做": 1,
    "平時作業跟期中都是分組完成,期中要上台報告自己那組平時作業挑選的電影,並加以分析電影中出現的音樂片段": 1,
    "老師人很好聊天，不會針對同學，上課都在最後下課點名，課堂上有討論就可以加分，這一次老師說如果加分超過的同學會把分數直接加去期末考，沒什麼功課，期中考以交功課來算分數，課堂會看影片，喜歡討論同學可以挑，只想拿學分同學也可以挑！大推": 1,
    "他的課就是要做PPT報告( 一學期大約三次) 我們對於這個單元的想法跟論點 然後要從書裡找句子證明我們的想法": 1,
    "佑鈞哥拜託不要當我": 0,
    "平時作業比較多": 1,
    "會洩題 整體算好過 但&lt;康才媛": 1,
    "被這個老師的民法嚇到了 覺得慎選": 1,
    "期中考是給圖片猜攝影師名字，沒一個認識的": 1,
    "之前修過": 0,
    "老師其實人算風趣  而且很懂學生在想什麼": 1,
    "Good": 1,
    "非常理論，很無聊，不夠認真不會知道要考什麼": 1,
    "但我認為應該也是學不到東西": 1,
    "上課會一直分享他的鯨魚": 1,
    "作業滿多 上課會管同學 大部分在聽她的故事以及看法國相關電影 可以用輕鬆的方法認識不同的法國 至於飯店用餐價錢1200上下(略忘)但cp值還好……主要在學禮儀 期末報告佔滿大的 我沒交所以被當": 1,
    "給分很大方": 1,
    "第二節課點名": 1,
    "老師講話靠杯": 1,
    "教PS": 0,
    "上課就是一直念稿子，算好過的課，不過要說學到東西大概也不多": 1,
    "寫得好並且花一些心思，老師都會給80以上唷!": 1,
    "期中報告是一場展覽/音樂會（跟西方藝術相關即可）的報告1200字 簡單 都給很高分": 1,
    "除此之外基本上很簡單過。": 1,
    "乖乖拿愛心 穩過": 1,
    "很好過的老師，但是他應該去上「手相與生辰八字」，而不是來上華人歷史。": 1,
    "我相信所以不要選": 1,
    "會點名": 0,
    "老師人很好，上課也可以學到東西，推推推": 1,
    "推翻你思考邏輯 沒有正確答案 只有翻轉再翻轉": 1,
    "考題都會給": 1,
    "想爽過的不要選!! 期末報告看的非常嚴格 會一直批評!! 老師說的跟做的不同 要注意!! 平常要常看Moodle 會有加分用的課後心得報告 有截止日期!!": 1,
    "一學期2次小組報告": 1,
    "想知道orz": 0,
    "超好玩的~~~選就對啦! 老師人超好的，他很喜歡研究手相之類的東西，上課也很有趣，但是期中的申論題要寫比較多，如果是想混的要考慮。": 1,
    "有人能分享嗎": 0,
    "要去背課文，上課都會一個一個點名來唸課文或是單字來點名。建議想認真修的再選": 1,
    "蠻推 整體算好過 ！期中考考選擇+手寫 不過我有點不認真 只考60 上課有再聽或講義背熟應該可以考很好 期末只要交紙本報告 有關日本文化就好": 1,
    "作業負擔重，但小組好好討論就行了，他一定會批評作業內容，但實際分數給的都不錯，期中考試滿簡單的，有背重點就會寫": 1,
    "這老師評價?": 0,
    "推推長髮永清": 1,
    "要做習作": 0,
    "啊就搶不到": 0,
    "期末是個人書面報告，照格式寫不會很難": 1,
    "期中期末會勾題目讓你練": 1,
    "求+1": 0,
    "張爽哥其羽": 0,
    "103年下": 0,
    "嫌雷課不多就選吧": 1,
    "會點名早來會加分 不用買課本老師會放moodle還有畫重點不會明確的說要考什麼但是就是從畫的重點出 期末要分組上台報告 期末考的題目有些好像會從各組報告的內容出 覺得有難度難猜題": 1,
    "老師很幽默，早八第一節點加分，第二節點扣分。會給考試內容，要做期末報告，考不好或缺席率高的同學可以用報告拉分，老師會提醒跟指導做報告。好過！": 1,
    "背很多單字，沒有小考。以後如果要從事觀光業可以學到很多東西。期末會考手寫題 - 計程車搭乘的介紹以及悠遊卡介紹(講義上都有)。": 1,
    "不建議外系+1~不過老師人還算不錯": 1,
    "老師人很好 不會太難過": 1,
    "淚推": 1,
    "請問如果外系選修能適應嗎？": 0,
    "我覺得很好過 有校外教學不用考期中期末考，但報告有五個，校外教學三次。": 1,
    "上課會問問題 有回答就可以加分": 1,
    "平常上課就常舉手發言就加分，所以有積極主動分數會很好看，看影片也會加分，老師很相信我們，最後下課老師會問我們這堂課加多少，就自己憑良心講。問題的答案都在影片裡面，期中做報告，期末考試。其實比較多時候老師會從影片的問題延伸到人生上面XDD總之很推人很好不無聊假如你是積極派的。": 1,
    "不會音樂的學生是屎": 1,
    "考試只考一次": 1,
    "但一定可以學到東西": 1,
    "老師名言：「你只要在我課堂上學到一樣有用的東西帶走，我這堂課你就過關了。」": 1,
    "請問會分組嗎都是考他上課的東西  不過老師現在越來越注重上課的態度了": 0,
    "給分如何啊？高嘛?考試會偏難嗎": 0,
    "上課可以收穫非常多的知識,無論未來是不是從事觀光業都一定對你有幫助,但是上課習慣划手機睡覺或愛翹課的就還是別去嘗試比較好..": 1,
    "每節課都要寫學習單 很沒意義的內容 老師不知道怎麼給成績 莫名就被當了": 1,
    "好過 只要其中報告交就好了": 1,
    "個人覺得很舒壓需有趣": 1,
    "期中左右會有辯論": 1,
    "請問期中期末分數會難拿嗎？": 0,
    "蠻推的！": 1,
    "就是一們聽故事 考故事的課!每節都會點名": 1,
    "他規矩很多~有板童 值日生 秘書 助教 還有規定座位 感覺進到古老高中時代...... 很煩XD": 1,
    "上課方式基本上就是PTT介紹+看影片寫心得。": 1,
    "超煩超不推": 1,
    "期中末考是考講義，有看有分。上課也輕鬆，是好過的課。": 1,
    "老師上課還蠻輕鬆自由的,也很歡迎同學回答問題或是說一下自己的想法": 1,
    "上課風趣，很親民的老師": 1,
    "祥得必選啊bj4": 1,
    "每週都有作業，但是方法都在講義上，需要花一點時間看，但是收穫很大！": 1,
    "期中平時全看出缺席，沒有額外的回家作業，只要準時上課不缺席，期中平時成績就是90": 1,
    "不過要看的內容很多就是了": 1,
    "很想知道這位老師的教學方式，不知道該不該去選": 0,
    "推推 老師人超級好": 1,
    "這個老師好過嗎": 0,
    "妳們難道是六年前的大學長姐": 0,
    "這是新老師嗎QQ": 0,
    "推壓力大啖學到很多，有很多機會表達自己": 1,
    "兩個報告，沒有期中考，每週小考。": 1,
    "遲到會規定坐最後一排，會扣分 每節看電影": 1,
    "老師很雞巴 上課一直問問題 還只能回答他講過的不是都不是正確答案 有自己一個專屬的「學生長相本」 不要以為到了就沒事 上課你做了甚麼事他看看那本就知道你是誰 期末考也難得要死20題多選不跟你說哪題單哪題多 錯一個全錯 衝出席率也沒用 ㄎㄎ雞巴佬超不推": 1,
    "不推！老師給分很主觀，期中會給考題（申論題），但寫很多也不見得分數高，每週都會點名有加分也有扣分，moodle 討論區要回答問題！": 1,
    "這門課好嗎?": 0,
    "老師跟貴婦沒什麼兩樣，想當貴婦就去聽看看吧，只想爽過的請直接跳過，並不輕鬆。": 1,
    "作業一堆，期中期末考ppt內容": 1,
    "老師講話很討厭，上課會一直點人回答問題，常常會針對遲到同學。但只要乖乖去上課，聽他說考什麼記一下，分數不會太差。": 1,
    "但上課內容非常有趣，不同於高中死上課本，上老師關心的歷史問題": 1,
    "期中難到靠腰但是會調分，上課都不點名，蹺課學生撿到寶？！？！": 1,
    "財金系大刀中的大刀": 1,
    "不要這樣說她啦!!他很好過欸~~且人也算不錯 只是教得太簡單 然後有點混而已": 1,
    "期中期末都有考試40% 平時60%": 0,
    "別浪費時間吧": 0,
    "分數給超低  非常不推": 1,
    "期中期末照自己的想法寫分數蠻高的，可以學到很多東西": 1,
    "上課不能交談不能玩手機": 0,
    "上課學不到東西": 1,
    "他投資學的教學態度很差": 0,
    "報告：各組準備一次的上台報告(完整的一堂課)，6~8人一組，報告過程中老師會中途插入講解。": 1,
    "大推 老師很用心": 1,
    "會有期中期末考嗎？": 0,
    "沒有期中期末考 會點名": 1,
    "還會加分": 0,
    "之邁的課非常好過 而且可以學到很多喔 前提是你要(1)聽得懂他的含滷蛋 (2)忍受每堂課都在講sex": 1,
    "期中考 期末考 考matlab的一些指令 用法": 1,
    "平常上課都看影片 期中是心得或藝術家報告 期末是公仔 給分很鬆": 1,
    "上課很好過": 1,
    "人不錯": 1,
    "(翻譯老師上課的原文講義)": 1,
    "上課輕鬆 必點名 花招多": 1,
    "真的很滿好過的，但考前一週一定要去，老師會講考試的東西": 1,
    "如果真的想學到東西這老師必選，數媒僅存少數的好老師呵呵": 1,
    "老師很搞笑很有親和力，會舉辦各種戶外活動，因為老師鼓勵我們走出去，去學習那些人生中的熱血與難忘，這些都是課本上得不到的收穫！": 1,
    "必搶~期中給一些題目期末只要報告就好上課超free": 1,
    "不算難過 可以學到很多東西": 1,
    "超級不佳": 1,
    "期中考問答題，跟考古題相似度高，期末小組報告要認真做。": 1,
    "翹課去玩都比較有意義。（真心）": 1,
    "雖然老師聽別人報告也在睡覺拉哈哈": 0,
    "想多了解這個老師": 0,
    "商務溝通平常是\"聽力課\"": 0,
    "分數給不錯 很愛點名 學不到什麼東西 一直重複一些東西 很無聊 又很明顯的東西 報告要個人報告1000字以上作成PPT 還要小組報高 還要求要找80歲以上的人做訪問 附圖 看影片的話別太開心 因為馬上就要做一個上傳 有期中 只要看牠放到MOODLE的PPT就很好過 而且PPT頁數不多 東西都很簡單": 1,
    "之前都一直提自己俄羅斯案子的事...": 0,
    "請問需要分組報告嗎??????": 0,
    "整學期課堂加分機會總共一百": 1,
    "每節課都要分組對打": 1,
    "老師人很可愛,期中考試(有點小難 我只有60),期末個人書面報告,大推~": 1,
    "老師不是每次上課都點名,但是還算頻繁": 1,
    "推 老師上課很有趣 講話很好笑 會請業師來上課 可以學到很多": 1,
    "每一堂都會有小作業(不難)": 1,
    "上課很輕鬆,有時會看影片,都是還不錯的,期中考前老師會複習,考的題目幾乎跟老師複習的一模一樣,期末是報告": 1,
    "推～": 1,
    "上課要忍受他的毒舌，但覺得他講話有趣的人就會很喜歡聽他評圖": 0,
    "請問沒期中期末考": 0,
    "筆記課。老師很有原則。可以過，但不高分也不算太難的課。都在講OP": 1,
    "想學習的別來，一開始帶著想要學習攝影藝術的心情完全被摧殘": 1,
    "可以學到很多實用的東西，拍片時老師也會親自來現場指導，上課用心，審作業也不馬虎，": 1,
    "(一般來說這學期會報PPT和EXCEL,不想考EXCEL也不行)": 1,
    "超輕鬆": 1,
    "點名採簽到制，上課有點無聊都在念文章，期中要好好念，不然真的不會寫": 1,
    "每節課都點名，期中考沒一題聽得懂　幾乎每次上課都要寫筆記　算平常成績": 1,
    "算好過": 1,
    "求上過的同學分享": 0,
    "賀老的課品質有保證，只要他開的課就是熱門。": 1,
    "上課就念標題": 0,
    "很有趣的老師 上課會跳著講 所以如果跟不上會不知道老師在說甚麼 考試很輕鬆 很好過 上課非常好玩好笑老師很有個性，認真上課是可以學到東西的，萬年考古題，推推": 1,
    "有人能分享考試和上課情況嗎？": 0,
    "請問在學甚麼阿~~": 0,
    "忍住悲哀": 1,
    "老師講話異常催眠": 1,
    "有上去玩的人分數會加很多": 1,
    "滿好過的，上課基本上都在看影片，有分組專題跟個人作業，老師個性有點微妙但人不錯。": 1,
    "期末要交Flash的作品出來 (所以要認真學)": 1,
    "超難": 1,
    "上課有點難懂她在教什麼，不過考前會給題目，雖很難背，但提早準備的話要過不難": 1,
    "上課做什麼都不管( 當然 不要太誇張), 偶爾交個影片心得, 500字, 上維基百科查個資料再自己寫一寫就有了, 期末報告可以自己做也可以和別人同組, 題目自訂,第二節下課前才點名，人很好": 1,
    "(好像全勤+Moodle都有回覆學期成績就有50分的樣子)": 1,
    "想知道+1 原本看的時候不是這個老師": 0,
    "上課就像在聽故事 有一個個人報告": 1,
    "選兩門他的課，可能你期中退選名額會不夠用": 1,
    "個人覺得學到的東西很有限": 1,
    "大~~推~~": 1,
    "跟一般的觀光課程不太一樣，會講到不同類型的產業景點。還會有出去校外教學的機會。上課活潑，考試不會很難，有上課就可以。": 1,
    "上課會介紹很多好吃好玩好有趣的東西，考試看課本看仔細一點就會過了，大推課": 1,
    "人超有趣哈哈": 1,
    "不然都會霧煞煞": 0,
    "有趣是有趣，但不好過，期中期末分數都不會給很高。": 1,
    "內容很豐富，但是因為時間關係所以很趕": 1,
    "老師態度很差，講話口齒不清，期中不能只看講義，會考很多沒有的東西，記得要來簽名點名，偶爾會抽點": 1,
    "上課不能玩手機": 0,
    "2.老師人很好 而且考試的時候有兩周 一周1~5組來考試(念課文) 6-10組就可以不用來  另一周也是如此": 1,
    "規擇非常多": 1,
    "期中期末都考試 只考一題  上課心得. 有一份作業 就是拍影片.": 1,
    "我指的是會話XDDDD": 0,
    "學麥克筆技法，老詹有點煩，對老師沒偏見的話這堂課不錯": 1,
    "期中考：考選擇題，如果學長姐或別班同學有考古題，借來就可以考高分甚至100喔。": 1,
    "請問學長姐到底推不推?": 0,
    "點名重，3次吧(?)沒到平時0分。上課還蠻無聊的，內容是講茶道跟神話等等，不過有請外師教一堂日本舞過。期中期末(都手寫題)題目下是一大欄格子寫越多越高分。考前會洩題，有的要自己上網找答案。有出席 考試有背 會掰 高分不難。": 1,
    "口頭禪：「的話呢…的話呢…的話呢…」": 0,
    "想問~": 0,
    "基本上有報告 上課都有到學期成績要90不是難事": 1,
    "老師脾氣暴躁，常有炫富言論，期末報告非常重要，要求很多規定嚴格且氣氛緊張": 1,
    "上課很開心很輕鬆": 1,
    "認真寫至少80": 1,
    "考前洩題": 1,
    "會有報告但不會很難。可以瞭解日本文化的課程，而且老師還會推薦日本料理餐廳。求心得+1": 1,
    "這是一個只要不吃早餐就能躺著過聽故事聽老師罵教育制度的課嘛!": 1,
    "記得每位學生": 0,
    "不推 期中考試寫超多 老師只給60幾分": 1,
    "數媒都醬": 0,
    "奶奶的課不去  就是對不起自己   能學到東西  老詩人又好  這種課  去哪找?": 1,
    "絕對不要懷疑Maya之神!": 0,
    "雖然有點麻煩": 1,
    "睡覺會被叫": 0,
    "是LEVEL超越必修的選修": 1,
    "Eva老師專長是心理學&speaking anxiety非常非常和藹可親的老師 ((但是他的會話課壓力很大 會學到很多~": 1,
    "除了聊天或吃東西有時候會被罵，上課做自己的事沒關係，很好過，當時考的考題完全考古題": 1,
    "地雷": 1,
    "喜歡舉實例不無聊": 1,
    "有人可以分享這個老師的評價嗎？": 0,
    "老師認真但上課睡覺玩手機會點你，期中期末考申論從PPT考但要上課聽作筆記，有一個閱讀近代華人傳記的讀書心得有固定格式1000字以上": 1,
    "老師希望學生多多發言，不論是對的還是錯的答案，只要願意回答，老師就會加分。上課沒有壓力，不用抄筆記，即使不聽也沒關係，但重要節日或天氣不好人很少的時候，一定要出席去點名！期中考是繳200字的心得，期末考是考申論題，考前會給5題，考兩題，背起來就好，第三題是寫自己對課堂的想法。好課！之前修的時候1~18週沒去過幾次(但心得報告都有交)，期末報告也沒去...但老師還是讓我過了(強烈建議不要學我)。": 1,
    "推": 1,
    "背詩一首10分～滿好過的～": 1,
    "作業一定要交": 0,
    "要學東西來修這門課就對了": 1,
    "老師的課總是滿班": 1,
    "推 上課有趣 常常講讓你反思的歷史翻案 期中考公布題目給你查(考完還會教幾堂手相八字算命課) 期末考小組作業(可2人)找一個歷史人物編劇情故事 可以寫大綱、小說、拍片 最後一天發表 哈哈一大堆搞基的惡搞情節": 1,
    "超級不推，人很機車，分數給很低=  =明明出席率考試都有到": 1,
    "考題背答案": 1,
    "神經病的老師，不要選": 1,
    "都有去上 被當了... 其中超難": 1,
    "期末讀書心得 分組報告": 1,
    "聽我的,每堂課都點名,期中考不難,但也不簡單,內容在講義裡,有點多就是了,期末沒考試,但是要交5頁的報告,5頁.......(有幾千字吧......)": 1,
    "認真聽講會發現老師的故事都很生活化不死板是經驗豐富的老師": 1,
    "請問這老師的上課方式?": 0,
    "點名第二節點 老師不看人 可以代點": 1,
    "兩星期點一次名，期中分數難拿，我個人覺得上課都在上很沒意義的東西，浪費時間(有的人覺得有趣?!)我是蠻不喜歡他的課!": 0,
    "推～超輕鬆的一門課～": 1,
    "大考給分很大方，有上課有考小考去考都至少有85分以上": 1,
    "第二節快下課才點名，上課會撥很多youtube新聞、廣告影片，要注意看，考試題目裡面出，考前會提供考古題給學生，大部分從裡面出題。": 1,
    "外星人長怎樣他們有鼻子有眼睛有耳朵嗎": 0,
    "老師最主要上課本，會提供旅遊常識與知識，上課也有趣! 期中用考試 ，期末採取小組報告，要報告如同導覽員帶你到世界各地走透透(會有指定地點)，詳細報告(當地交通、交通費、旅遊費、機票費等還有當地文化特色、伴手禮選擇、飯店規格、飯店設備、等等細節的旅遊須知)完全要報告的像是自助旅行那樣的細項安排": 1,
    "人真的很nice": 1,
    "去年修過，內容很扎實，有翻轉教室還有文章閱讀心得報告。老師上課很嚴格，但真的可以學到東西。": 1,
    "◆作業": 0,
    "有準備有分": 1,
    "老師機車 超愛問問題 必點名 中間也不會下課 分數給的也蠻不公平 不推": 1,
    "老師人好 上課內容豐富 作業絕對合理 大推～": 1,
    "老師上課一直講自己的學經歷  人脈之類的=.=": 0,
    "大推，課程內容豐富，上課氣氛很好很有趣，老師會鼓勵學生發表自己的想法，可以訓練到自己的思維整理及敘述表達": 1,
    "求解><": 0,
    "蘇老師的課都非常推薦。老師主要上課本。講課本主題的重點，並希望妳繼老師講的重點後再去自己讀。可以學到很多東西": 1,
    "可以學到很多，平常會有小作業但不難": 1,
    "推薦給只想賺營養學分的人XD": 1,
    "我以為 輕鬆過": 0,
    "很重視期末報告內容，平時上完課要到moodle上傳心得（不可忽略，不然有可能老師很狠心的給你59分）": 1,
    "推推老師人超好，期中OPEN BOOK分數都很高，想高分的人MOODLE會開心得單可以自己去填，不寫也不會扣分，報告是看指定的影片回答一些問題。期中前每次上課的內容都要都要做筆記，因為其中的簡答題就從裡面出；期中後開始分組做期末報告，之後還要交一次關於上課心得的作業。點名六次三次沒到就Out": 1,
    "是真的很認真在上課的老師！如果你真的想要學到一些東西的話 請務必選這個老師的課！期中期末考題都會給 但是如果給你了 你還不去背然後分數低抱怨就是你的問題了 所以不願意花時間背書和做報告的同學也請不要選這位老師的課 反正我個人和周圍的認真唸書的朋友都有拿高分就對了。個人非常喜歡這位老師！": 1,
    "請問有人可以提供這堂課老師的評論嗎？謝謝！外系想修不知道會不會很難搶 很難過？": 0,
    "講話很有魅力": 0,
    "修了後會發現蠻燒錢的 可以學到攝影傳統技法(沖相紙跟底片之類的) 每堂課幾乎都有作業 期末要交作品集 如果沒有按照進度完成會覺得被作業追著跑": 1,
    "老師很有趣~~ 上課以報告方式進行 內容包括 社會語言學 腦神經語言學 語言習得等等": 1,
    "有誰有什麼建議嗎": 0,
    "一年級上她的課，老師人蠻好的，每節都點名，不要遲到太誇張可以補點，就算請假系統上請假了還是會扣分哦，會算出席成績。考試就照規定來不太放水，上課就照課程進度來該做的都會做。": 1,
    "老師人真的很~~~好~~~": 1,
    "別選他的課 神經病": 1,
    "上課會播影片，老師喜歡下來找人回答問題，比較屬於聊天模式，只要把想法講出來無論對錯都ok，很簡單就可以加到分，期末考也不難，只要有稍微聽課就大概都能回答。": 1,
    "有人可以分享上課內容嗎還有分數好拿嗎 謝謝": 0,
    "我一年級休的時候，上課不能吃早餐如果要吃要在他點名前吃完，然後點名好像上課五分鐘後就點": 0,
    "但考試也不考那個": 0,
    "就算過了學校TQC的門檻還是要報考最後一個": 1,
    "兩次電影心得報告 期末分組交報告": 1,
    "開學會發講義，每週都要小考一個章節": 1,
    "有古典音樂底子的人可以去, 對音樂一竅不通的人你就別去": 1,
    "上課都以實際例子講解": 1,
    "這堂課老師不錯 我衰在組員有些很雷 他媽的LINE上討論都不回應的": 1,
    "期末都8,90過": 1,
    "每個禮拜考試，需要課前自己預習課本內容，小考成績占滿重的": 1,
    "作業期中出席都有做到但卻被當了": 1,
    "潛能開發與創意思維的課程": 0,
    "好過 點名用簽的": 1,
    "老師很好，要學習可選這堂課，考試覺得不難。": 1,
    "Morgan the Faggot": 0,
    "很難得": 1,
    "請問期中期末的考試方式?": 0,
    "講話很酸，會趕旁聽的同學離開，選在別人下課的時候上課，大不推！": 1,
    "但如果老師是一樣的": 0,
    "但沒學到什麼東西": 0,
    "有要分組嗎": 0,
    "一個研究報告，每週有小考，老師是美國波士頓人，雖然看起來很機車但其實很樂意跟學生溝通。有讀書就能過。": 1,
    "我選": 1,
    "好過的可是沒錯啦": 1,
    "有期末考 考他上課講的東西": 0,
    "是個認真的老師，不過老師會希望給學生很多東西，所以上課速度很快，也建議不要缺課才能完整學到東西": 1,
    "考試是全申論題嗎?": 0,
    "上課不會管 點名用紙本點": 1,
    "好老師": 1,
    "重視出席，老師年紀很大，細節有點孤僻，水彩新手可以去學，很不錯，已經會畫水彩的就沒什麼必要": 1,
    "頭腦要很清楚": 1,
    "老師講的東西都聽不懂": 1,
    "如果要學到東西的話，不推，不過還算好過": 1,
    "期中末不要考太差 沒記錯前面都選擇題": 1,
    "分組報告為主體 需要有好隊友 如果學會了 就會寫論文了": 1,
    "老師已經80多歲，重視出席、在課堂上不能用手機（基本尊重），衣服請著：黑色、白色、淺色（禁止大紅大紫）會影響視覺。老師很善良，用心就能感受到她想要教授給你的東西。如果是頑皮的學生，希望你不要選這堂課來氣老師。": 1,
    "又是Moodle作業又是紙本作業還要報告，頗囉嗦的老師": 1,
    "大推的老師如果能早點遇到有多好!!!!!": 1,
    "非常宗教的一門課==好過，六十到八十這樣。不是高分爽過": 1,
    "看到和昌就不要選": 1,
    "小心慎選!!!": 1,
    "考試很難.放音樂寫對應歌名((都西方英文歌": 1,
    "請問老師如何?": 0,
    "好過 不常點名": 1,
    "林佩穎很正": 1,
    "好過的課": 1,
    "林老師人超好，又很會教": 1,
    "上課方式?想知道+1": 0,
    "在期末報告前私底下整組找老師演練一次 老師對你們有好印象之後就會很順利 也能順便先幫你們改錯": 1,
    "老師人很好，點名偶然想到才點，通常是第二節才點，比較建議下學期選，會有小小好事發生，不過最好是同系一起，不然期末作業量有些多，找不到人只能自己一組": 1,
    "坐在蓮花上的佛,上課實務教程,成績公道,是個黑臉佛心的老師, PS一定要做作業不然佛也救不了你": 1,
    "老師很愛跟漂亮美眉聊天~ 然後要小心一旦他記起你的名字的話每堂課只要看到你就會不斷點你回答問題什麼的(有時候前一天做作業沒睡飽又被狂點真的會被他煩到)，雖然他有時候給的建議真的可有可無，可是自己回家有投入在畫的畫會覺得過程很療癒，但是害怕早八的同學就不要選了吧如果不喜歡畫這個的話會覺得去那邊浪費生命，但是學會以後還蠻多作業可以用麥克筆來征服的。": 1,
    "申論隨便掰很高很高": 1,
    "上課內容很好笑 很多很扯的佛經故事": 1,
    "選到的人真他媽雖小欸～老師上課教你玩手指，下課不下課講什麼想像眼睛塗了舒服的膠水，幹傻眼欸是在傳播什麼邪教嗎==": 1,
    "真的會學到很多東西": 1,
    "老師非常媚日~!一直介紹日本的東西,在中國文化方面沒啥著墨!很多分組報告 上學期期中考考申論題  老師的ppt一定要看  考試就會寫了  其實不難過": 1,
    "推 考前會給單字表": 1,
    "恭喜樓上": 0,
    "期中期末都考試嗎?還是有分組報告?": 0,
    "很有難度": 1,
    "好不容易搶到好老師的課結果發現換成她.雷": 0,
    "每次上課都會小考": 1,
    "期末考試也是考他上課的東西": 1,
    "愛昀寰": 0,
    "有發言有加分": 1,
    "老師打分數很鬆.鬆到你不好意思退~而且教學很用心": 1,
    "他教我們班統計": 0,
    "上台報告1.2次分數就很高 考前會洩題": 1,
    "課程主要學習基礎的電磁波的工程應用，老師教授基本的微波工程的知識。能夠學到一些以後沒心思學，也沒有機會學到的知識，極力推薦。 例如PCB一些電路的走線，在高頻時，就可構成電容或電感 etc": 1,
    "跟電視攝影跟媒體實務都用同一份ppt，其中期末交影片，我之前沒交也有78分，教壞掉光碟也有80，如果你覺得你繳學費上這種課你開心，那你就選吧！": 1,
    "如果你想多一堂英文課就選這門吧": 1,
    "看到張其羽就是學分的保證": 1,
    "好啦想一想還是覺得不大好，反正就是大概有這樣的狀況，剛剛是我太激動了，就是大家自己評估一下，加油喔!": 0,
    "老師人很好，認真授課，極少點名，其中交個人音樂心得報告，非常好過，推。上課不太管，會辦小型演講在上課時間，如果有去有加分，期中考畫圖，給分很高，要去看展覽，一樣可以加分，期末是報告": 1,
    "想學到東西的話不推，上課不會管你在做什麼，都在講他自己的也不管有沒有人聽，但是就算很認真聽也聽不懂": 1,
    "個人報告要做2000 字.......": 1,
    "人很好 不難過": 1,
    "人還不錯 想睡 會讓你睡 但一段時間就會把你挖醒~作業就一學期 一次商務報告-介紹產品 要講 要回答老師的問題": 1,
    "老師很重視邏輯思考 如果你不喜歡動腦  還是別去.但如果很喜歡的話  很推": 1,
    "出席很重要": 0,
    "老師最不喜歡重視利益的學生了，還是個法國愛好者呢~~": 0,
    "美慧很可愛": 1,
    "如何?給分高嘛?": 0,
    "分數背題庫，不難拿分": 1,
    "教得很清楚": 1,
    "包庇怪同學": 1,
    "我來造福一下人群了": 0,
    "(老師200%用心教，只是很介意學生遲到跟出席問題)": 1,
    "大推這門課 老師人很有趣~會講很廢的笑話 跟他在國外的一些故事 但不會扯太遠": 1,
    "教學認真": 1,
    "謝老師上課嚴格，能學到不少東西，但是隔壁的田老師比較好過。": 1,
    "所以期初會讓我們做職能診斷，發現自己不足之處。並在期中交一份報告，是有關診斷的結果與自己評量想要改善哪部分，並簡單列出計畫。期末則是真正的去實行計劃改善自己不足的地方，並記錄下來做成報告呈交。": 1,
    "期中期末算好準備，題目銘傳大學裡都有考古題。": 1,
    "不推，雷課": 1,
    "可以當作期貨選擇權的先修": 0,
    "考期中 不用準備就可以去考": 1,
    "這個老師會校外教學嗎？第一堂課就會點嗎？": 0,
    "也會考名詞解釋跟平時的實作或申論題": 1,
    "超混的老師 聽說十年都交一樣的": 1,
    "原來會翻譯就能當教授": 0,
    "老師很堅持自己的理論，不跟他辯照他方式走分數都很高，偶爾點名，三次未到會被當": 1,
    "輕鬆被虐": 1,
    "如果你對一堂好課的定義是輕鬆過不用唸書做做也就可以及格，不點名，沒期中考，千萬不要來選這堂課; 但如果你是真心對攝影有興趣，又不知從何開始的話，一定要來修這堂課，千萬不要覺得老師機車，因為他是真心想讓你學到東西。": 1,
    "老師超好": 1,
    "爽": 1,
    "\\碰/": 0,
    "腦袋有在思考才能去": 1,
    "老師上課都看地板上課": 0,
    "PS喜歡鮮豔可愛有點俗氣的東西。": 0,
    "期中帶我們去上直銷公司的化妝課": 1,
    "幾乎每節點名": 1,
    "(p.s 加分作業是做什麼概念圖的(加上200還300左右的心得吧?如果我沒記錯的話),也是有一大把的PDF要看,看完你才知道&quot;概念圖&quot;怎麼做(不過我看了2.3份PDF大概知道怎麼做了)": 1,
    "推一個 算是業師 所以課程都是晚上上課 交的JAVA肯定好": 1,
    "人不錯，不過個人覺得課程有點無聊，大概就是喝喝飲料喝喝咖啡": 1,
    "好過 老師人很好 期中期末要考試 考試考上課的PPT請問期末報告是個人還是團體呢?": 1,
    "嚴格但是學得到東西": 1,
    "班上有慘痛的經驗。": 1,
    "老師真的會出": 0,
    "請問老師如何？": 0,
    "過了一學期都還在講自己的豐功偉業，上課放自己過去的動畫作品，和透視無關。": 1,
    "無聊的課 上課沒重點 廢話很多 班上每堂課睡覺的人必超過一半 ps只有影片分析非常好 其他略過": 1,
    "平時成績亂打 沒到及上課睡覺的同學還比全勤上課寫筆記的同學高 對認真上課的同學蠻不公平的": 1,
    "期中隨便寫87": 1,
    "推，鼓勵學生發言，講錯也沒關係，會加分": 1,
    "只要記憶力很好就沒問題XD 期中考後操作專案軟體 蠻簡單的": 1,
    "簽名一定要去教室前面簽名 常常記錯人缺席 回答問題還會被刁難": 1,
    "出缺席很重要。沒有期中期末考試。大概一週到兩週會有一次moodle上的課程討論，大概第2.3週後會開始有分組討論大報告持續到期末。期末後要做自己半年來的作業整理給老師。老師注重學生個人想法與思考，也非常在意學生對於課程上的吸收或學習熱忱。說實話不是輕鬆好過的通識課，但如果想要在大學通識課學到東西，極推這位老師。老師也會配合時事調整課程內容。上課做什麼都不管( 當然不要太誇張), 偶爾交個影片心得,  500字,  上維基百科查個資料再自己寫一寫就有了, 期末報告可以自己做也可以和別人同組, 題目自訂,第二節下課前才點名，人很好": 1,
    "但易過": 1,
    "我愛琦珍(告白": 0,
    "無趣~ 一個自我感覺良好的老師": 0,
    "年輕的老師,會分組做作業,不會難過,玩樂團有問題也可以問她": 1,
    "上課聽故事，期中期末考都有「超級重點提示」，不過老師的自我意識比較強烈，時常罵看不爽的人事物「小雜碎」，我是覺得滿好笑的，可以接受的人應該會修得很開心。": 1,
    "◆上課風格": 0,
    "這課不選還是人？": 1,
    "不推": 1,
    "期中期末考前洩題 分數高": 1,
    "老師不喜歡我們上課打瞌睡，打瞌睡合併無故缺席次數3次以上就會被當。": 1,
    "有人能分享考試和上課狀況＼類的嗎？": 0,
    "基本上好過。": 1,
    "分組報告？": 0,
    "跟高中公民的心理學程度差不多，好過": 1,
    "即使你不是報告組也部會倖免": 1,
    "極不推 老師態度很差 教人沒耐心  上課還先去幫隔壁班羽球點名  對女生比較差": 1,
    "考試有點難,要讀很多文學史的內容,有一次平時報告": 1,
    "雖然我外系的 但有過欸XDDD~": 0,
    "這個老師就像魔獸世界的稀有怪讚": 1,
    "有報告嗎": 0,
    "超好過!!": 1
}